# Pandas with DataFrame

In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
data={'state':['ohio','ohio','ohio','nevada','nevada','nevada'],
      'year':[2000,2001,2002,2001,2002,2003],
      'pop':[1.5,1.7,3.6,2.4,2.9,3.2]}

In [4]:
frame=pd.DataFrame(data)

In [5]:
frame

    state  year  pop
0    ohio  2000  1.5
1    ohio  2001  1.7
2    ohio  2002  3.6
3  nevada  2001  2.4
4  nevada  2002  2.9
5  nevada  2003  3.2

In [6]:
frame.head()

    state  year  pop
0    ohio  2000  1.5
1    ohio  2001  1.7
2    ohio  2002  3.6
3  nevada  2001  2.4
4  nevada  2002  2.9

In [7]:
pd.DataFrame(data,columns=['pop','year','state'])

   pop  year   state
0  1.5  2000    ohio
1  1.7  2001    ohio
2  3.6  2002    ohio
3  2.4  2001  nevada
4  2.9  2002  nevada
5  3.2  2003  nevada

In [9]:
frame2=pd.DataFrame(data,columns=['year','state','pop','debt'],index=['one','two','three','four','five','six'])

In [10]:
frame2

       year   state  pop debt
one    2000    ohio  1.5  NaN
two    2001    ohio  1.7  NaN
three  2002    ohio  3.6  NaN
four   2001  nevada  2.4  NaN
five   2002  nevada  2.9  NaN
six    2003  nevada  3.2  NaN

In [11]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [12]:
frame2['state']

one        ohio
two        ohio
three      ohio
four     nevada
five     nevada
six      nevada
Name: state, dtype: object

In [13]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [14]:
frame2.loc['three']

year     2002
state    ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [15]:
frame2['debt']=16.5

In [16]:
frame2

       year   state  pop  debt
one    2000    ohio  1.5  16.5
two    2001    ohio  1.7  16.5
three  2002    ohio  3.6  16.5
four   2001  nevada  2.4  16.5
five   2002  nevada  2.9  16.5
six    2003  nevada  3.2  16.5

In [17]:
frame2['debt']=np.arange(6.)

In [18]:
frame2

       year   state  pop  debt
one    2000    ohio  1.5   0.0
two    2001    ohio  1.7   1.0
three  2002    ohio  3.6   2.0
four   2001  nevada  2.4   3.0
five   2002  nevada  2.9   4.0
six    2003  nevada  3.2   5.0

In [19]:
val=pd.Series([-1.2,-1.5,-3.8],index=['two','four','five'])

In [20]:
frame2['debt']=val

In [21]:
frame2

       year   state  pop  debt
one    2000    ohio  1.5   NaN
two    2001    ohio  1.7  -1.2
three  2002    ohio  3.6   NaN
four   2001  nevada  2.4  -1.5
five   2002  nevada  2.9  -3.8
six    2003  nevada  3.2   NaN

In [22]:
frame2['eastern']=frame2.state=='ohio'

In [23]:
frame2

       year   state  pop  debt  eastern
one    2000    ohio  1.5   NaN     True
two    2001    ohio  1.7  -1.2     True
three  2002    ohio  3.6   NaN     True
four   2001  nevada  2.4  -1.5    False
five   2002  nevada  2.9  -3.8    False
six    2003  nevada  3.2   NaN    False

In [24]:
del frame2['eastern']

In [25]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [35]:
frame2.pop={'naveda':{2001:2.4,2002:2.9},
    'ohio':{2000:1.5,2001:1.7,2002:3.6}}

In [36]:
frame3=frame2

In [37]:
frame3

       year   state  pop  debt
one    2000    ohio  1.5   NaN
two    2001    ohio  1.7  -1.2
three  2002    ohio  3.6   NaN
four   2001  nevada  2.4  -1.5
five   2002  nevada  2.9  -3.8
six    2003  nevada  3.2   NaN

In [38]:
frame4=frame2.pop

In [39]:
frame4

{'naveda': {2001: 2.4, 2002: 2.9}, 'ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [52]:
pd.DataFrame(pop,index=[2001,2002,2003])

      naveda  ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [62]:
frame2.index.name='year';frame2.columns.name='state'

In [63]:
frame2

state  year   state  pop  debt
year
one    2000    ohio  1.5   NaN
two    2001    ohio  1.7  -1.2
three  2002    ohio  3.6   NaN
four   2001  nevada  2.4  -1.5
five   2002  nevada  2.9  -3.8
six    2003  nevada  3.2   NaN

In [64]:
frame2.values

array([[2000, 'ohio', 1.5, nan],
       [2001, 'ohio', 1.7, -1.2],
       [2002, 'ohio', 3.6, nan],
       [2001, 'nevada', 2.4, -1.5],
       [2002, 'nevada', 2.9, -3.8],
       [2003, 'nevada', 3.2, nan]], dtype=object)